# ViewSolarstudyIsStillimageStudyType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyIsStillimageStudyType Property
ParameterTypeId Class See Also
---
"Still image study"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyIsStillimageStudyType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyIsStillimageStudyType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyIsStillimageStudyType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace